# 완쪽 괄호의 개수와 오른쪽 괄호의 개수가 같아야한다.
# 같은 괄호에서 왼쪽 괄호는 오른쪽 괄호보다 먼저 나와야 한다.
# 괄호 사이에는 포함 관계만 존재한다.

# 여는 괄호는 스택에 넣고, 닫는 괄호가 나오면 가장 최근에 넣은 여는 괄호와 짝이 맞는지 확인하기

#1. 문자열에 있는 괄호를 차례대로 검사하면서 왼쪽 괄호를 만나면 스택에 삽입하고,
#   오른쪽 괄호를 만나면 스택에서 top괄호를 삭제한 후 오른쪽 괄호와 짝이 맞는지를 검사한다.
#2. 이때 스택이 비어 있으면 조건1 또는 조건2에 위배되고 괄호의 짝이 맞지 않으면 조건3에 위배된다.
#3. 마지막 괄호까지 조사한 후에도 스택에 괄호가 남아 있으면 조건 1에 위배된다.

# top 이라는 변수를 직접 움직여서 스택을 구현한 코드 
# ( 나오면 스택에 넣는다 -> top 증가
# ) 나오면 스택에서 꺼낸다 -> top 감소

txt = input()

# 스택 생성
top = -1
stack = [0] * 100

ans = 1
for x in txt:
    if x == '(':  # 여는 괄호면 push
        top += 1
        stack[top] = x
    elif x == ')': # 닫는 괄호면 꺼내서 확인
        if top == -1: # 스택이 비어있으면 오류(여는 괄호 부족)
            ans = 0
            break  # for x
        else:  # 짝이 맞는지 확인하기 ..
            top -= 1
print(ans)




