# 16진수 1자리는 2진수 4자리로 표시된다.
# N자리 16진수가 주어지면 각 자리 수를 4자리 2진수로 표시하는 프로그램 짜기

T = int(input())

for tc in range(1, T+1):
    N, hex_form = input().split()
    N = int(N)

    hex_to_bin = {
        '0':'0000', '1':'0001', '2':'0010', '3':'0011',
        '4':'0100', '5':'0101', '6':'0110', '7':'0111',
        '8':'1000', '9':'1001', 'A': '1010', 'B': '1011',
        'C':'1100', 'D': '1101', 'E': '1110', 'F':'1111'
    }

    bin_form = ''

# 16진수 문자열을 한글자씩 꺼내서, 딕셔너리에 저장된 2진수로 변환한 뒤 이어 붙이는 역할(i는 인덱스x)
    for i in hex_form:
        bin_form += hex_to_bin[i]

    print(f"#{tc} {bin_form}")


