'''
7 11 
0 1 32
0 2 31
0 5 60
0 6 51
1 2 21
2 4 46
2 6 25
3 4 34
3 5 18
4 5 40
4 6 51
'''
# 가중치가 최소인 간선을 빨리 찾기 위한 최소 합 사용
from heapq import heappop, heappush

# V: 정점의 개수, E: 간선의 개수
V, E = map(int, input().split())

# 그래프 인접 리스트
G = [[] for _ in range(V)]

for i in range(E):
    # 한 줄에 입력 3개 => 정점1(s), 정점2(e), 가중치(w)
    s, e, w = map(int, input().split())
    # 가중치가 있는 그래프의 경우 인접리스트 생성 방법
    G[s].append((e,w))
    G[e].append((s,w))

"""
1. 시작 정점(임의의 정점)을 결정해서 거기서부터 신장트리 만들기 시작. 
2. 내가 지금까지 골랐던 정점들과 인접하는 정점중에 최소 가중치를 가진 간선을 선택(조건: 이전에 선택한적 없는 정점과 이어진 간선)
3. 위의 과정을 MST가 만들어질 때 까지 반복  
"""

def prim(s):
    # 우선순위큐(최소합)
    heap = []
    # 중복체크
    # MST[1] = 1: 1번 정점은 MST에 현재 포함되어있다. (이전에 1번 정점을 선택했다.)
    # MST[2] = 0: 2번 정점은 MST에 포함되어 있지 않다. (이전에 2번 정점을 선택하지 않았다.)
    MST = [0] * V

    # 최소비용
    MIN = 0

    # 선택을 몇번했는지 기억해서 MST의 완성 유무를 체크
    cnt = 0

    # 힙에 시작정점 정보를 넣고 추가 (가중치, 정점번호)
    # 힙의 우선순위 선정 기준은 튜플의 첫번째 원소, 시작정점의 가중치는 0에서 시작
    heappush(heap, (0, s))

    # 가중치가 최소인 간선을 선택하는 일을 반복
    # 선택한 정점의 개수가 총 정점 개수보다 작으면 아직 완성이 x, 합에 원소가 남아있어야 함
    while cnt < V and heap:
        # w: 가중치
        # v: 정점번호
        w, v = heappop(heap)

        # 내가 현재 선택 가능한 간선중에 최소값을 찾아야하지만 heap 사용하면 pop만 해도 최소 가중치를 가진 간선정보가 나온다.

        # 내가 예전에 v번 정점으로 가는 최소 가중치 간선을 선택했다면, 중복선택 안됨, 건너뜀
        if MST[v]:
            continue

        # v를 선택
        MST[v] = 1

        # 가중치합
        MIN += w

        # 선택횟수 + 1
        cnt += 1

        # v를 추가했으니, v에서 선택할 수 있는 새로운 간선 정보들도 우선순위큐에 추가
        for nv, nw in G[v]:
            # nv : v에서 갈 수 있는 새로운 정점 번호
            # nw : 그때 가중치

            # 이때 nv가 내가 예전에 선택한적 있는 정점 번호면 추가할 필요 없다.
            if MST[nv]:
                continue

            # v => nv로 가는 간선정보 우선순위큐에 추가
            heappush(heap, (nw, nv))

    return MIN

print(f"MST 최소 가중치 합: {prim(0)}")
print(f"MST 최소 가중치 합: {prim(4)}")












